Revit 2024 API
AddInId Members
The AddInId type exposes the following members.
Constructors
Name | Description
AddInId
 creates an AddInId object with a given GUID
Methods
Name | Description
Dispose
Releases all resources used by the AddInId
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetAddInName
 name of addin associated with this AddInId Attempts to obtain the name from loaded Third Party AddIns
GetAddInNameFromDocument
 name of application associated with this ApplicationId First attempts to obtain the name from AddInIds stored in the document. If unsuccessful, attempts to obtain the name from loaded Third Party AddIns.
GetGUID
 value of the AddInId as a GUID
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
AddInId Class
Autodesk.Revit.DB Namespace